```terraform
  # aws_docdb_cluster.veritoplama_api will be destroyed
  # (because aws_docdb_cluster.veritoplama_api is not in configuration)
  - resource "aws_docdb_cluster" "veritoplama_api" {
      - arn                             = "arn:aws:rds:eu-central-1:366354050833:cluster:veritoplama-api" -> null
      - availability_zones              = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> null
      - backup_retention_period         = 5 -> null
      - cluster_identifier              = "veritoplama-api" -> null
      - cluster_members                 = [
          - "veritoplama",
        ] -> null
      - cluster_resource_id             = "cluster-HSDYAPC7NO5GQ2H2JGT4FWJNEY" -> null
      - db_cluster_parameter_group_name = "veritoplama-api" -> null
      - db_subnet_group_name            = "veritoplama" -> null
      - deletion_protection             = false -> null
      - enabled_cloudwatch_logs_exports = [] -> null
      - endpoint                        = "veritoplama-api.cluster-cw7baaxsvx1k.eu-central-1.docdb.amazonaws.com" -> null
      - engine                          = "docdb" -> null
      - engine_version                  = "4.0.0" -> null
      - global_cluster_identifier       = "" -> null
      - hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> null
      - id                              = "veritoplama-api" -> null
      - kms_key_id                      = "" -> null
      - master_password                 = (sensitive value)
      - master_username                 = (sensitive value) -> null
      - port                            = 27017 -> null
      - preferred_backup_window         = "22:02-22:32" -> null
      - preferred_maintenance_window    = "wed:00:32-wed:01:02" -> null
      - reader_endpoint                 = "veritoplama-api.cluster-ro-cw7baaxsvx1k.eu-central-1.docdb.amazonaws.com" -> null
      - skip_final_snapshot             = true -> null
      - storage_encrypted               = false -> null
      - tags                            = {} -> null
      - tags_all                        = {} -> null
      - vpc_security_group_ids          = [
          - "sg-0a6eda14712bd08e7",
        ] -> null
    }

  # aws_docdb_cluster_instance.veritoplama will be destroyed
  # (because aws_docdb_cluster_instance.veritoplama is not in configuration)
  - resource "aws_docdb_cluster_instance" "veritoplama" {
      - arn                          = "arn:aws:rds:eu-central-1:366354050833:db:veritoplama" -> null
      - auto_minor_version_upgrade   = true -> null
      - availability_zone            = "eu-central-1b" -> null
      - ca_cert_identifier           = "rds-ca-2019" -> null
      - cluster_identifier           = "veritoplama-api" -> null
      - db_subnet_group_name         = "veritoplama" -> null
      - dbi_resource_id              = "db-T4REF76TS6URH5UNWOOQYU7IX4" -> null
      - endpoint                     = "veritoplama.cw7baaxsvx1k.eu-central-1.docdb.amazonaws.com" -> null
      - engine                       = "docdb" -> null
      - engine_version               = "4.0.0" -> null
      - id                           = "veritoplama" -> null
      - identifier                   = "veritoplama" -> null
      - instance_class               = "db.t3.medium" -> null
      - port                         = 27017 -> null
      - preferred_backup_window      = "22:02-22:32" -> null
      - preferred_maintenance_window = "sun:00:52-sun:01:22" -> null
      - promotion_tier               = 0 -> null
      - publicly_accessible          = false -> null
      - storage_encrypted            = false -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null
      - writer                       = true -> null
    }

  # aws_docdb_cluster_parameter_group.veritoplama will be destroyed
  # (because aws_docdb_cluster_parameter_group.veritoplama is not in configuration)
  - resource "aws_docdb_cluster_parameter_group" "veritoplama" {
      - arn         = "arn:aws:rds:eu-central-1:366354050833:cluster-pg:veritoplama-api" -> null
      - description = "Managed by Terraform" -> null
      - family      = "docdb4.0" -> null
      - id          = "veritoplama-api" -> null
      - name        = "veritoplama-api" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "tls" -> null
          - value        = "disabled" -> null
        }
    }

  # aws_rds_cluster.veritoplama_api will be created
  + resource "aws_rds_cluster" "veritoplama_api" {
      + allocated_storage               = (known after apply)
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = [
          + "eu-central-1a",
          + "eu-central-1b",
          + "eu-central-1c",
        ]
      + backup_retention_period         = 5
      + cluster_identifier              = "veritoplama-api"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "veritoplama"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "veritoplama"
      + deletion_protection             = true
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "serverless"
      + engine_version                  = (known after apply)
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = (sensitive value)
      + network_type                    = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_security_group_ids          = [
          + "sg-0a6eda14712bd08e7",
        ]
    }

  # aws_secretsmanager_secret_version.veritoplama_env must be replaced
-/+ resource "aws_secretsmanager_secret_version" "veritoplama_env" {
      ~ arn            = "arn:aws:secretsmanager:eu-central-1:366354050833:secret:veritoplama-prod-env-vhpvcR" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:eu-central-1:366354050833:secret:veritoplama-prod-env-vhpvcR|BF256623-C742-483B-9A4E-F58F4540B572" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "BF256623-C742-483B-9A4E-F58F4540B572" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 4 to destroy.
```